# Даны 3 переменные: first = ‘I’, second = ‘love’, third = ‘Python’. Напишите программу,
# которая с помощью этих переменных распечатывает такой текст: “I love Python!”
first = "I"
second = "love"
third = "Python"
print(first + ' ' + second + ' ' + third + '!')
